source : https://leetcode.com/studyplan/30-days-of-pandas/

In [2]:
import numpy as np
import pandas as pd

# 1050. Actors and Directors Who Cooperated At Least Three Times

In [5]:
# Inputt Data
actor_director = pd.DataFrame({'actor_id': [1, 1, 1, 1, 1, 2, 2],
                               'director_id': [1, 1, 1, 2, 2, 1, 1],
                               'timestamp': [0, 1, 2, 3, 4, 5, 6]})

In [7]:
# My Solution
def actors_and_directors(actor_director: pd.DataFrame) -> pd.DataFrame:
    result = actor_director.groupby(
        ['actor_id', 'director_id']).count().reset_index().rename(
            columns={'timestamp':'count'}).copy()

    return result[result['count'] >= 3][['actor_id', 'director_id']]

actors_and_directors(actor_director)

   actor_id  director_id
0         1            1

# 1378. Replace Employee ID With The Unique Identifier

In [8]:
# Input Data
employees = pd.DataFrame({'id': [1, 7, 11, 90, 3], 'name': ['Alice', 'Bob', 'Meir', 'Winston', 'Jonathan']})
employee_uni = pd.DataFrame({'id': [3, 11, 90], 'unique_id': [1, 2, 3]})

In [9]:
# My Solution
def replace_employee_id(employees: pd.DataFrame, employee_uni: pd.DataFrame) -> pd.DataFrame:
    result = employees.merge(employee_uni, how='left', on='id')
    return result[['unique_id', 'name']]

replace_employee_id(employees, employee_uni)

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

# 1280. Students and Examinations

> 문제의 체점이 이상한 것처럼 보인다.<br>
문제에서 요구하는대로 풀이를 하고 결과도 동일하게 나오는데, Leetcode상에서는 Wrong answer로 나온다.<br>
Solution을 찾아봤는데, Solution에 올라와있는 코드들을 그대로 실행해도 전부 틀렸다고 표시되었다.<br>
댓글을 읽어보니 다른 사람들도 마찬가지의 상황인 것 같았다.

In [11]:
# Input Data
students = pd.DataFrame({'student_id': [1, 2, 13, 6], 'student_name': ['Alice', 'Bob', 'John', 'Alex']})
subjects = pd.DataFrame({'subject_name': ['Math', 'Physics', 'Programming']})
examinations = pd.DataFrame({'student_id': [1, 1, 1, 2, 1, 1, 13, 13, 13, 2, 1],
                             'subject_name': ['Math', 'Physics', 'Programming', 'Programming', 'Physics',
                                              'Math', 'Math', 'Programming', 'Physics', 'Math', 'Math']})

In [12]:
# My Solution
def students_and_examinations(students: pd.DataFrame, subjects: pd.DataFrame, examinations: pd.DataFrame) -> pd.DataFrame:
    students_subjects = students.merge(subjects, how='cross').sort_values('student_id')

    students_exam = students.merge(examinations, how='outer', on='student_id').sort_values('student_id')
    exam_count = students_exam.groupby(['student_id', 'subject_name']).count().reset_index()

    result = students_subjects.merge(
                    exam_count, how='left', on=['student_id', 'subject_name']).rename(
                    columns={'student_name_x':'student_name', 'student_name_y':'attended_exams'})

    result['attended_exams'] = result['attended_exams'].fillna(0)

    return result

students_and_examinations(students, subjects, examinations)

    student_id student_name subject_name  attended_exams
0            1        Alice         Math             3.0
1            1        Alice      Physics             2.0
2            1        Alice  Programming             1.0
3            2          Bob         Math             1.0
4            2          Bob      Physics             0.0
5            2          Bob  Programming             1.0
6            6         Alex         Math             0.0
7            6         Alex      Physics             0.0
8            6         Alex  Programming             0.0
9           13         John         Math             1.0
10          13         John      Physics             1.0
11          13         John  Programming             1.0

# 570. Managers with at Least 5 Direct Reports

In [13]:
# Input Data
employee = pd.DataFrame({'id': [101, 102, 103, 104, 105, 106],
                         'name': ['John', 'Dan', 'James', 'Amy', 'Anne', 'Ron'],
                         'department': ['A', 'A', 'A', 'A', 'A', 'B'],
                         'managerId': [np.nan, 101, 101, 101, 101, 101]})

In [14]:
# My Solution
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    manager_count = employee.groupby('managerId').count()
    over_five = manager_count[manager_count['id'] >= 5]

    return employee[employee['id'].isin(over_five.index)][['name']]

find_managers(employee)

   name
0  John

# 607. Sales Person

In [20]:
# Input Data
sales_person = pd.DataFrame({'sales_id': [1, 2, 3, 4, 5],
                             'name': ['John', 'Amy', 'Mark', 'Pam', 'Alex'],
                             'salary': [100000, 12000, 65000, 25000, 5000],
                             'commission_rate': [6, 5, 12, 25, 10],
                             'hire_date': ['4/1/2006', '5/1/2010', '12/25/2008', '1/1/2005', '2/3/2007']})
company = pd.DataFrame({'com_id': [1, 2, 3, 4], 'name': ['RED', 'ORANGE', 'YELLOW', 'GREEN'],
                        'city': ['Boston', 'New York', 'Boston', 'Austin']})
orders = pd.DataFrame({'order_id': [1, 2, 3, 4],
                       'order_date': ['1/1/2014', '2/1/2014', '3/1/2014', '4/1/2014'],
                       'com_id': [3, 4, 1, 1], 'sales_id': [4, 5, 1, 4],
                       'amount': [10000, 5000, 50000, 25000]})

In [16]:
# My Solution
def sales_persons(sales_person: pd.DataFrame, company: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    company.rename(columns={'name':'company_name'}, inplace=True)

    order_company = orders.merge(company, how='left', on='com_id')
    all_df = order_company.merge(sales_person, how='left', on='sales_id')

    red_person = all_df[all_df['company_name']=='RED'][['name']]

    return sales_person[sales_person['name'].isin(list(red_person['name'])) == False][['name']]

sales_persons(sales_person, company, orders)

   name
1   Amy
2  Mark
4  Alex

In [21]:
# Referenced Solution
def sales_persons(sales_person: pd.DataFrame, company: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    order_company = orders.merge(company, how='left', on='com_id')

    red_orders = order_company[order_company['name']=='RED']

    return sales_person[~sales_person['sales_id'].isin(red_orders['sales_id'].unique())][['name']]
                        # 물결 무늬(~)를 맨 앞에 붙일 경우 반대를 출력하라는 의미이다.
sales_persons(sales_person, company, orders)

   name
1   Amy
2  Mark
4  Alex